using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class FantasyNameGenerator
{
    public static string[] names =
    {"Арагорн","Арвен","Бильбо Бэггинс","Том Бомбадил","Боромир","Фродо Бэггинс","Водный Страж",
        "Галадриэль","Гил-Галад","Гимли","Глорфиндел","Голлум","Голос Саурона","Грима Червеуст",
        "Гэндальф","Даин II Железностоп","Древобород","Дурин","Дэнетор II","Золотинка","Исилдур",
        "Келеборн","Кирдан Корабел","Король-чародей Ангмара","Леголас","Мериадок Брендибак",
        "Перегрин Тук","Радагаст","Саруман","Саурон","Список королей гномов народа Дурина",
        "Сэмуайз Гэмджи","Теоден","Тингол","Торин Дубощит","Трандуил","Фарамир","Финарфин",
        "Финвэ","Фингон","Хельм Молоторукий","Эарендил","Элендил","Элронд","Элрос","Эовин","Эомер",};

    public static string GetRandomName()
    {
        return names[Random.Range(0, names.Length)];
    }
}
